app/views/reservations/index.html.erb

<%= month_calendar do |date| %>
  <% reserved_count = Reservation.where(start_date: date).count %>
  <% total_sites = Site.count %>
---
SELECT COUNT(*) FROM `reservations` WHERE `reservations`.`start_date` = '2025-04-28'
SELECT COUNT(*) FROM `sites`