app/controllers/reservations_controller.rb

SELECT `sites`.* FROM `sites`
---
  def new
    @reservation = Reservation.new(start_date: params[:date])
    @sites = Site.all

INSERT INTO `reservations` (`user_id`, `site_id`, `start_date`, `end_date`, `status`, `payment_status`, `total_price`, `created_at`, `updated_at`) VALUES (1, 1, '2025-05-10', '2025-05-11', 'pending', 'unpaid', 0, '2025-05-09 09:26:13.022124', '2025-05-09 09:26:13.022124')
---
  def create
    @reservation = current_user.reservations.build(reservation_params)
    if @reservation.save