app/controllers/sites_controller.rb

SELECT `sites`.* FROM `sites`
SELECT `reservations`.* FROM `reservations`
---
  def index
    @sites = Site.all
    @reservations = Reservation.all