app/views/sites/index.html.erb

SELECT COUNT(*) FROM `reservations` WHERE `reservations`.`start_date` = '2025-04-28'
---

    <% reservations_count = Reservation.where(start_date: date).count %>